In [2]:
import pandas as pd

# Series

In [3]:
pd.Series(["Julie", "René", "Corentin"])

0       Julie
1        René
2    Corentin
dtype: object

In [5]:
serie = pd.Series(["Julie", "René", "Corentin"], index=["étudiant1", "étudiant2", "étudiant3"])

In [6]:
serie.index

Index(['étudiant1', 'étudiant2', 'étudiant3'], dtype='object')

In [7]:
serie["étudiant1"]

'Julie'

* il est possible d ajouter une cellule clef:valeur

In [31]:
serie2 = pd.Series({"name1": 1, "name2": 2, "name3": 3})

In [34]:
is_inf = (serie2 > 1) & (serie2 < 3)

In [35]:
serie2[is_inf]

name2    2
dtype: int64

In [41]:
serie2.loc[["name1", "name3"]] #inclu

name1    1
name3    3
dtype: int64

In [42]:
serie2.iloc[0:2] #exclu

name1    1
name2    2
dtype: int64

# DataFrame

* sequence de Series "alignés"

* chaque Series est une colonne
* pd.DataFrame() est le constructor de la class
* index sur les rows, index sur les colonnes
* cela rssemble à SQL ou Excel

In [47]:
df = pd.DataFrame({
                "age": pd.Series([18,25,45,36]),
                "nom": pd.Series(["Julien", "Corentin", "Seb", "Lucas"])
             })

In [48]:
df.columns

Index(['age', 'nom'], dtype='object')

In [50]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [51]:
df

   age       nom
0   18    Julien
1   25  Corentin
2   45       Seb
3   36     Lucas

In [52]:
df.shape

(4, 2)

In [53]:
df["age"]

0    18
1    25
2    45
3    36
Name: age, dtype: int64

In [54]:
df.age # peu recommandé

0    18
1    25
2    45
3    36
Name: age, dtype: int64

In [55]:
df["nbr_child"] = 1

In [56]:
df.shape

(4, 3)

In [57]:
df

   age       nom  nbr_child
0   18    Julien          1
1   25  Corentin          1
2   45       Seb          1
3   36     Lucas          1

In [58]:
import numpy as np
df["nbr_child"] = np.exp(df["nbr_child"])

In [59]:
df

   age       nom  nbr_child
0   18    Julien   2.718282
1   25  Corentin   2.718282
2   45       Seb   2.718282
3   36     Lucas   2.718282

In [60]:
df2 = pd.DataFrame({
                "nbr_child": pd.Series(2.718282)
             })

In [61]:
df2

   nbr_child
0   2.718282

In [62]:
df + df2

   age  nbr_child  nom
0  NaN   5.436564  NaN
1  NaN        NaN  NaN
2  NaN        NaN  NaN
3  NaN        NaN  NaN

In [67]:
df3 = pd.DataFrame(np.random.randint(0, 10, (3, 4)))

In [68]:
df3

   0  1  2  3
0  4  3  8  5
1  5  4  3  5
2  0  6  6  1

In [69]:
df2 + df3

   nbr_child   0   1   2   3
0        NaN NaN NaN NaN NaN
1        NaN NaN NaN NaN NaN
2        NaN NaN NaN NaN NaN

In [71]:
df4 = df3.sample(3)

In [72]:
df4

   0  1  2  3
0  4  3  8  5
1  5  4  3  5
2  0  6  6  1

In [73]:
df3 + df4

    0   1   2   3
0   8   6  16  10
1  10   8   6  10
2   0  12  12   2

##### toutes les operations alignent les index
##### Selection  iloc & loc

In [74]:
df["age"] > 3

0    True
1    True
2    True
3    True
Name: age, dtype: bool

In [75]:
df.loc[df["age"] > 3, "nom"]

0      Julien
1    Corentin
2         Seb
3       Lucas
Name: nom, dtype: object

In [78]:
df.loc[(df["age"] > 3) & (df["nom"] == "Julien" ) | (df["nom"] == "Corentin" )]

   age       nom  nbr_child
0   18    Julien   2.718282
1   25  Corentin   2.718282

In [79]:
df.dtypes

age            int64
nom           object
nbr_child    float64
dtype: object

In [81]:
df

   age       nom  nbr_child
0   18    Julien   2.718282
1   25  Corentin   2.718282
2   45       Seb   2.718282
3   36     Lucas   2.718282

* dataFrame().dropna(axis=0) supprimer les lignes avec les valeurs manquantes
* how="all" pour une ligne qui a toutes la valeurs des colonnes manquantes
* thresh=2 au moins deux valeurs manquantes par ligne
* tresh